GT2/RANS/KOmegaSST_highRE_roughness/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

//1 to 10 times laminar vis
internalField   uniform 2e-07;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    slipsurface
    {
        //type            zeroGradient;
        type            slip;
    }
    bottom
    {
        //type 	   	nutUSpaldingWallFunction;
        //value           uniform 0;

        type 		nutkRoughWallFunction;
        Ks              uniform 0.0001;		//sand-grain roughness height - 0 smooth wall - This case 100 micron equivalent to medium	
        Cs              uniform 0.5;		//roughness constant - Typical values 0.5-1.0
	value           uniform 0;		//dummy for paraview
    }

    frontandback
    {
	type	empty;
    }
}

// ************************************************************************* //
