GT2/RANS/KOmegaSST_highRE_roughness/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type probes;
libs ("libsampling.so");

// Fields to be probed. runTime modifiable!
fields
(
    p
    U
    wallShearStress
);

// Locations to be probed. runTime modifiable!
probeLocations
(
    (1.95 0	0)
    (1.95 0.0000000001	0)
    (1.95 0.0000001	0)
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
